## Introduction to SQL

**Load the data set with**

    psql -U isdb -d postgres -f babynames_load.sql

In [1]:
%load_ext sql

In [2]:
%%sql
postgresql://isdb@localhost/postgres

'Connected: isdb@postgres'

**[Q] What is the total number of records in the file (1 record per line)**

In [3]:
%%sql

select count(fname)
  from Baby_Names;

1 rows affected.

[(5838786,)]

** [Q] According to this data set, what is the total number of babies?**

In [4]:
%%sql

select sum(number)
  from Baby_Names;

1 rows affected.

[(305154531,)]

** [Q] How many boys were born?**

In [7]:
%%sql

  select sum(number)
    from Baby_Names
   where gender = 'M'

1 rows affected.

[(158464584,)]

**[Q] How many girls were born?**

In [11]:
%%sql

  select sum(number)
    from Baby_Names
   where gender = 'F'

1 rows affected.

[(146689947,)]

**[Q] Suppose we want to see the count of boys and girls at the same time?**

In [12]:
%%sql

  select gender, sum(number)
    from Baby_Names
group by gender;

2 rows affected.

[('F', 146689947), ('M', 158464584)]

**[Q] Order the states by the number of births and list the top 10**

In [15]:
%%sql

  select state, sum(number)
    from Baby_Names 
   group by state
order by sum(number) desc
   limit 10;

10 rows affected.

[('CA', 30115165),
 ('NY', 24278846),
 ('TX', 22531981),
 ('PA', 17001653),
 ('IL', 15552256),
 ('OH', 14541388),
 ('MI', 11915920),
 ('FL', 9826318),
 ('NC', 8732253),
 ('NJ', 8555911)]

** [Q] What are the most popular baby names in 2016 **

In [17]:
%%sql
-- emma, olivia, noah 

   select fname, sum(number)
     from baby_names
    where year = 2016
 group by fname 
 order by sum(number) desc
    limit 10;

10 rows affected.

[('Emma', 19414),
 ('Olivia', 19246),
 ('Noah', 19093),
 ('Liam', 18138),
 ('Ava', 16237),
 ('Sophia', 16070),
 ('William', 15668),
 ('Mason', 15240),
 ('James', 14790),
 ('Isabella', 14722)]

**[Q] What are the most popular boy's names in 2016?**

In [18]:
%%sql 

   select fname, sum(number)
     from baby_names
    where (year = 2016) and (gender='M')
 group by fname 
 order by sum(number) desc
    limit 10;

10 rows affected.

[('Noah', 19015),
 ('Liam', 18138),
 ('William', 15668),
 ('Mason', 15192),
 ('James', 14776),
 ('Benjamin', 14569),
 ('Jacob', 14416),
 ('Michael', 13998),
 ('Elijah', 13764),
 ('Ethan', 13758)]

**[Q] What are the most popular girl's names in 2016?**

In [20]:
%%sql 

   select fname, sum(number)
     from baby_names
    where (year = 2016) and (gender='F')
 group by fname 
 order by sum(number) desc
    limit 10;

10 rows affected.

[('Emma', 19414),
 ('Olivia', 19246),
 ('Ava', 16237),
 ('Sophia', 16070),
 ('Isabella', 14722),
 ('Mia', 14366),
 ('Charlotte', 13030),
 ('Abigail', 11699),
 ('Emily', 10926),
 ('Harper', 10733)]